Autodesk.Revit.DB.ExportDWGSettings.GetActivePredefinedSettings(Autodesk.Revit.DB.Document)
Returns the active pre-defined non-in-session exporting settings for DWG in the given document.
aDoc:
A Revit document to retrieve the active pre-defined exporting settings for DWG.
Returns:
The active pre-defined exporting settings for DWG, or null if nothing pre-defined exists or the in-session settings is selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ExportDWGSettings.FindByName(Autodesk.Revit.DB.Document,System.String)
Returns the pre-defined non-in-session exporting settings for DWG in the given document with the specified name.
aDoc:
A Revit document to retrieve the specified pre-defined exporting settings for DWG.
name:
The name of the settings to retrieve.
Returns:
The pre-defined DWG exporting settings, or null if nothing found that has the corresponding name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013